{
    "entry_point": "steel_mill_slab_design_problem:SteelMillSlabDesignProblem",
    "default_params": {
      "instance_file": "instances/12orderproblem.in"
    },
    "problem_type": "Steel Mill Slab Design",
    "description": "In this problem, orders (each with a required weight and a color) must be assigned to slabs. A slab’s produced size is determined by the sum of the orders assigned to it, and the corresponding waste is computed by a pre-defined saw-tooth function. Each slab can contain orders of at most 2 colors and its total content cannot exceed the maximum available slab size. The goal is to minimize the total waste of steel.",
    "keywords": [
      "steel mill",
      "slab design",
      "waste minimization",
      "assignment",
      "optimization"
    ],
    "data_format": {
      "instance_file": {
        "format": "The first line contains the number of slab sizes followed by the list of available slab sizes (sorted in ascending order). The next line contains the number of colors. The following line contains the number of orders. Then, for each order, two numbers are provided: the order quantity and its color."
      }
    },
    "decision_variables": {
      "slabs": {
        "type": "list of lists of int",
        "description": "A partition of orders (indexed 0 to nb_orders-1) into slabs. Each inner list represents the orders assigned to that slab."
      }
    },
    "objective": {
      "type": "minimization",
      "function": "Total Waste = Σ waste(slab_content) over used slabs",
      "description": "Minimize the total steel waste, where for each slab the waste is determined by the difference between the next available slab size and the slab’s content. Infeasible solutions (violating capacity or color constraints, or not forming a valid partition) are heavily penalized."
    },
    "solution_representation": "A list of slabs, each slab a list of order indices.",
    "compatible_optimizers": [
      "genetic_algorithm",
      "simulated_annealing",
      "particle_swarm",
      "tabu_search",
      "rl_optimizer"
    ]
  }
  